Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpression Constructor (DateTimeFilterExpression, DateTimeOperatorType, DateTimeConstantFilterExpression)
 Initializes a new instance of the BinaryFilterExpression class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BinaryFilterExpression(
	DateTimeFilterExpression Left,
	DateTimeOperatorType Oper,
	DateTimeConstantFilterExpression Right
)
Public Sub New (
	Left As DateTimeFilterExpression,
	Oper As DateTimeOperatorType,
	Right As DateTimeConstantFilterExpression
)
Parameters
Left
Type: Tekla.Structures.Filtering.DateTimeFilterExpression
The left operand of the filter expression.
Oper
Type: Tekla.Structures.Filtering.DateTimeOperatorType
The operator of the filter expression.
Right
Type: Tekla.Structures.Filtering.DateTimeConstantFilterExpression
The right operand of the filter expression.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when a null filter expression is specified.
See Also
Reference
BinaryFilterExpression Class
BinaryFilterExpression Overload
Tekla.Structures.Filtering Namespace